; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph1 - mode
	image0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star7 - direction
	Star14 - direction
	Star1 - direction
	Star12 - direction
	GroundStation11 - direction
	Star6 - direction
	GroundStation9 - direction
	Star8 - direction
	Star5 - direction
	Star10 - direction
	Star13 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star13)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star8)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(have_image Planet15 image0)
	(have_image Phenomenon16 image0)
	(have_image Planet17 thermograph1)
	(have_image Planet18 thermograph1)
))

)

; plan
1. (turn_to satellite0 groundstation11 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation11)
   goals met: 0 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
3. (calibrate satellite0 instrument0 groundstation11)
   added: (calibrated instrument0)
   goals met: 0 of 4
4. (turn_to satellite0 planet15 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 planet15)
   goals met: 0 of 4
5. (take_image satellite0 planet15 instrument0 image0)
   added: (have_image planet15 image0)
   goals met: 1 of 4
6. (turn_to satellite0 phenomenon16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 4
7. (take_image satellite0 phenomenon16 instrument0 image0)
   added: (have_image phenomenon16 image0)
   goals met: 2 of 4
8. (turn_to satellite0 planet17 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet17)
   goals met: 2 of 4
9. (take_image satellite0 planet17 instrument0 thermograph1)
   added: (have_image planet17 thermograph1)
   goals met: 3 of 4
10. (turn_to satellite0 planet18 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet18)
   goals met: 3 of 4
11. (take_image satellite0 planet18 instrument0 thermograph1)
   added: (have_image planet18 thermograph1)
   goals met: 4 of 4
